IDENTIFICATION DIVISION.
PROGRAM-ID. PROG2.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBER        PIC 9(5) VALUE 53278.
01 DIGIT         PIC 9.
01 RESULT        PIC X(10) VALUE SPACES.
01 INDEX         PIC 9 VALUE 1.

PROCEDURE DIVISION.
MAIN-PROCESS.
   PERFORM UNTIL NUMBER = 0
      COMPUTE DIGIT = FUNCTION MOD(NUMBER 10)
      IF FUNCTION MOD(DIGIT 2) = 0
         MOVE DIGIT TO RESULT (INDEX:1)
         ADD 1 TO INDEX
      END-IF
      DIVIDE NUMBER BY 10 GIVING NUMBER
   END-PERFORM.

    DISPLAY "EVEN NUMBERS: " RESULT.

    DISPLAY "DONE SUCCESSFULLY".
    STOP RUN.